Tekla.Structures.Drawing.LengthPropertyElement
The LengthPropertyElement class represents a mark element that is of Length type.

Tekla.Structures.Drawing.LengthPropertyElement.Unit
Gets or sets the unit attributes.

Tekla.Structures.Drawing.LengthPropertyElement.Clone
Clones the object.
Returns: A copy of the object.